#+title: Ps 04
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-04-12>
#+lastmod: <2026-04-12 20:09>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t
#+startup: overview latexpreview inlineimages

*** (c)

#+begin_src julia :results value :exports both :tangle julia/p_01.jl
using Plots

f(x, y) = x^2 + y^2
L(x, y) = 2x + 4y - 5

xs = -6:0.05:6
ys = -6:0.05:6

anim = Animation()

for azimuth in 0:2:360
    surface(xs, ys, (x, y) -> f(x, y),
            alpha=0.8,
            colorbar=false,
            label="f(x,y)")
    surface!(xs, ys, (x, y) -> L(x, y),
             alpha=0.6,
             color=:reds,
             label="L(x,y)")
    scatter!([1], [2], [5],
             color=:black,
             markersize=4,
             label="(1,2,5)")
    plot!(xlabel="x", ylabel="y", zlabel="z",
          camera=(azimuth, 20),
          size=(800, 800))
    frame(anim)
end

gif(anim, "./assets/p_01_c.gif", fps=30)
#+end_src

#+RESULTS:
: Plots.AnimatedGif("/Users/ziro2173/personal/university/01_bachelor/02_semester/01_analysis/02_exercises/set_04/assets/p_01_c.gif")

*** (c)

#+begin_src julia :results value :exports both :tangle julia/p_02.jl
using Plots

f(x, y) = x * y
L(x, y) = x + y - 1

xs = -6:0.05:6
ys = -6:0.05:6

anim = Animation()

for azimuth in 0:2:360
    surface(xs, ys, (x, y) -> f(x, y),
            alpha=0.8,
            colorbar=false,
            label="f(x,y)")
    surface!(xs, ys, (x, y) -> L(x, y),
             alpha=0.6,
             color=:reds,
             label="L(x,y)")
    scatter!([1], [1], [1],
             color=:black,
             markersize=4,
             label="(1,1,1)")
    plot!(xlabel="x", ylabel="y", zlabel="z",
          camera=(azimuth, 20),
          size=(800, 800))
    frame(anim)
end

gif(anim, "./assets/p_02_c.gif", fps=30)
#+end_src

#+RESULTS:
: Plots.AnimatedGif("/Users/ziro2173/personal/university/01_bachelor/02_semester/01_analysis/02_exercises/set_04/assets/p_02_c.gif")

